{
  "Credit Cards": "Use your credit card responsibly by paying your balance in full each month to avoid high interest charges.\nKeep track of your credit utilization ratio; it is recommended to use no more than 30% of your available credit.\nReport any unauthorized charges to your bank immediately.",
  "Mortgages": "Before applying for a mortgage, review your credit score and financial history.\nCompare interest rates from different lenders to find the best rate.\nUnderstand the terms of your mortgage, including fixed vs. variable rates and any associated fees.",
  "Savings": "Aim to save at least 10-20% of your monthly income.\nConsider setting up automatic transfers from your checking account to a savings account.\nResearch high-yield savings accounts for better interest returns.",
  "Loans and Investments": "Evaluate your ability to repay before taking on new loans.\nDiversify your investments to manage risk.\nConsult with a financial advisor for personalized investment strategies.",
  "General Banking": "Always safeguard your personal and account information.\nRegularly monitor your account statements for any discrepancies.\nContact our help-desk for any questions related to banking services.",
  "Branch Locations": "Our main branch is located at 123 Main Street, Anytown, and we have several branches throughout the city. Visit our website for detailed addresses and operating hours.",
  "Account Opening": "To open a new account, please visit one of our branches with a valid ID, proof of address, and the required initial deposit. You may also begin the process online via our website.",
  "ATM Services": "Our ATMs are available 24/7 for cash withdrawals, balance inquiries, and mini statements. They are located at various convenient spots including shopping malls and near our branches.",
  "Online Banking Support": "For issues with online banking—such as login difficulties, password resets, or transaction questions—please visit our website or call our dedicated support hotline.",
  "Loan Applications": "If you wish to apply for a personal or business loan, visit our loan department at any branch or contact our loan support team for assistance with competitive interest rates and flexible repayment options."
}
